jeffersonjhunt/pinled/sdkconfig.defaults
# pinled v2 build defaults (ESP-IDF 5.5.x, target esp32s3)
# Board: Adafruit QT Py ESP32-S3, 8 MB flash, no PSRAM (chip marking FN8C0).

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# The QT Py ESP32-S3 has no USB-UART bridge — USB-C goes straight to the S3's
# native USB. Without this the console is on UART0 and `idf.py monitor` shows
# nothing.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Custom partition table with an NVS partition for machine profiles
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# A little more main-task stack for init
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# FreeRTOS tick at 1 kHz eases sub-ms task timing during bring-up
CONFIG_FREERTOS_HZ=1000

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# TIMING.md section 2 derives every scan-budget number from a 240 MHz LX7.
# The esp32s3 default is 160 MHz, which inflates the frame budget by 1.5x.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
